app/views/countries/show.html.erb

SELECT COUNT(*) FROM "cities"  WHERE "cities"."country_id" = $1  [["country_id", 1]]
---
              <td>
                <%= country.cities.count %>