app/controllers/additional_bed_types_controller.rb

INSERT INTO "additional_bed_types" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-12-18 00:44:27.680336"], ["name", "Lit d’appoint"], ["updated_at", "2014-12-18 00:44:27.680336"]]
---
  def create
    @additional_bed_type = AdditionalBedType.new(params[:additional_bed_type])

    if @additional_bed_type.save

SELECT "additional_bed_types".* FROM "additional_bed_types"   ORDER BY name ASC
---
  def show
    @additional_bed_types = AdditionalBedType.all

SELECT  "additional_bed_types".* FROM "additional_bed_types"  WHERE "additional_bed_types"."id" = 1  ORDER BY name ASC LIMIT 1
---
  def edit
    @additional_bed_type = AdditionalBedType.find_by_id(params[:id])

SELECT  "additional_bed_types".* FROM "additional_bed_types"  WHERE "additional_bed_types"."id" = 1  ORDER BY name ASC LIMIT 1
SELECT  1 AS one FROM "additional_bed_types"  WHERE ("additional_bed_types"."name" = 'Lit d’appointe' AND "additional_bed_types"."id" != 1) LIMIT 1
UPDATE "additional_bed_types" SET "name" = $1, "updated_at" = $2 WHERE "additional_bed_types"."id" = 1  [["name", "Lit d’appointe"], ["updated_at", "2014-12-18 00:45:20.096143"]]
---
  def update
    @additional_bed_type = AdditionalBedType.find_by_id(params[:id])
    @additional_bed_type_name = @additional_bed_type.name

    if @additional_bed_type.blank?
      render :file => "#{Rails.root}/public/404.html", :status => 404, :layout => false
    else
      if @additional_bed_type.update(params[:additional_bed_type])

SELECT  "additional_bed_types".* FROM "additional_bed_types"  WHERE "additional_bed_types"."id" = 2  ORDER BY name ASC LIMIT 1
---
  def enable
    @additional_bed_type = AdditionalBedType.find_by_id(params[:id])

SELECT  "additional_bed_types".* FROM "additional_bed_types"  WHERE "additional_bed_types"."id" = 2  ORDER BY name ASC LIMIT 1
---
  def disable
    @additional_bed_type = AdditionalBedType.find_by_id(params[:id])