app/controllers/bed_types_controller.rb

  def create
    @bed_type = BedType.new(params[:bed_type])

    if @bed_type.save
---
INSERT INTO "bed_types" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-12-18 00:09:03.574990"], ["name", "Très grand lit"], ["updated_at", "2014-12-18 00:09:03.574990"]]

  def show
    @bed_types = BedType.all
---
SELECT "bed_types".* FROM "bed_types"   ORDER BY name ASC

  def edit
    @bed_type = BedType.find_by_id(params[:id])
---
SELECT  "bed_types".* FROM "bed_types"  WHERE "bed_types"."id" = 3  ORDER BY name ASC LIMIT 1

  def update
    @bed_type = BedType.find_by_id(params[:id])
    @bed_type_name = @bed_type.name

    if @bed_type.blank?
      render :file => "#{Rails.root}/public/404.html", :status => 404, :layout => false
    else
      if @bed_type.update(params[:bed_type])
---
SELECT  "bed_types".* FROM "bed_types"  WHERE "bed_types"."id" = 3  ORDER BY name ASC LIMIT 1
UPDATE "bed_types" SET "name" = $1, "updated_at" = $2 WHERE "bed_types"."id" = 3  [["name", "Lit de petite tailleu"], ["updated_at", "2014-12-18 00:23:35.102799"]]

  def enable
    @bed_type = BedType.find_by_id(params[:id])
---
SELECT  "bed_types".* FROM "bed_types"  WHERE "bed_types"."id" = 2  ORDER BY name ASC LIMIT 1

  def disable
    @bed_type = BedType.find_by_id(params[:id])
---
SELECT  "bed_types".* FROM "bed_types"  WHERE "bed_types"."id" = 2  ORDER BY name ASC LIMIT 1