app/controllers/cities_controller.rb

INSERT INTO "cities" ("country_id", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["country_id", 1], ["created_at", "2014-12-17 22:31:27.681547"], ["name", "Abidjan"], ["updated_at", "2014-12-17 22:31:27.681547"]]
---
  def create
    @city = City.new(params[:city])
    init_index

    if @city.save

SELECT "cities".* FROM "cities"   ORDER BY name ASC
---
  def show
    @cities = City.all

SELECT  "cities".* FROM "cities"  WHERE "cities"."id" IS NULL  ORDER BY name ASC LIMIT 1
---
  def edit
    @city = City.find_by_id(params[:id])

SELECT  "cities".* FROM "cities"  WHERE "cities"."id" IS NULL  ORDER BY name ASC LIMIT 1
UPDATE "cities" SET "country_id" = $1, "updated_at" = $2 WHERE "cities"."id" = 1  [["country_id", 3], ["updated_at", "2014-12-17 23:06:45.522160"]]
---
  def update
    @city = City.find_by_id(params[:id])
    @city_name = @city.name

    if @city.blank?
      render :file => "#{Rails.root}/public/404.html", :status => 404, :layout => false
    else
      if @city.update(params[:city])

SELECT  "cities".* FROM "cities"  WHERE "cities"."id" = 1  ORDER BY name ASC LIMIT 1
---
  def enable
    @city = City.find_by_id(params[:id])

SELECT  "cities".* FROM "cities"  WHERE "cities"."id" = 1  ORDER BY name ASC LIMIT 1
---
  def disable
    @city = City.find_by_id(params[:id])