app/controllers/countries_controller.rb

  def show
    @countries = Country.all
---
SELECT "countries".* FROM "countries"   ORDER BY name ASC

  def cities
    @country = Country.find_by_id(params[:country_id])
---
SELECT  "countries".* FROM "countries"  WHERE "countries"."id" = 1  ORDER BY name ASC LIMIT 1

  def enable
    @country = Country.find_by_id(params[:id])
---
SELECT  "countries".* FROM "countries"  WHERE "countries"."id" = 1  ORDER BY name ASC LIMIT 1

  def disable
    @country = Country.find_by_id(params[:id])
---
SELECT  "countries".* FROM "countries"  WHERE "countries"."id" = 1  ORDER BY name ASC LIMIT 1