app/controllers/hotels_controller.rb

INSERT INTO "hotels" ("address", "city_id", "created_at", "description", "email", "front_content_type", "front_file_name", "front_file_size", "front_updated_at", "latitude", "location_description", "longitude", "mobile_number", "name", "phone_number", "rooms_description", "stars", "terms", "updated_at", "website") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    @hotel = Hotel.new(params[:hotel])

    init_index

    if @hotel.save

SELECT "hotels".* FROM "hotels"   ORDER BY name ASC
---
  def show
    @hotels = Hotel.all

SELECT  "hotels".* FROM "hotels"  WHERE "hotels"."id" = 1  ORDER BY name ASC LIMIT 1
---
  def edit
    @hotel = Hotel.find_by_id(params[:id])

SELECT  "hotels".* FROM "hotels"  WHERE "hotels"."id" = 1  ORDER BY name ASC LIMIT 1
UPDATE "hotels" SET "authorization_number" = $1, "stars" = $2, "updated_at" = $3 WHERE "hotels"."id" = 1  [["authorization_number", "PUL547HG6"], ["stars", 6], ["updated_at", "2014-12-18 16:04:10.467431"]]
---
  def update
    @hotel = Hotel.find_by_id(params[:id])
    @hotel_name = @hotel.name

    if @hotel.blank?
      render :file => "#{Rails.root}/public/404.html", :status => 404, :layout => false
    else
      if @hotel.update(params[:hotel])

SELECT  "hotels".* FROM "hotels"  WHERE "hotels"."id" = 1  ORDER BY name ASC LIMIT 1
---
  def enable
    @hotel = Hotel.find_by_id(params[:id])

SELECT  "hotels".* FROM "hotels"  WHERE "hotels"."id" = 1  ORDER BY name ASC LIMIT 1
---
  def disable
    @hotel = Hotel.find_by_id(params[:id])

SELECT  "hotels".* FROM "hotels"  WHERE "hotels"."id" = 1  ORDER BY name ASC LIMIT 1
---
  def specification
    @hotel = Hotel.find_by_id(params[:hotel_id])

SELECT  "hotels".* FROM "hotels"  WHERE "hotels"."id" = 1  ORDER BY name ASC LIMIT 1
INSERT INTO "specifications" ("created_at", "hotel_id", "name", "specification_type_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-18 17:30:16.246386"], ["hotel_id", 1], ["name", "Chambres et étages"], ["specification_type_id", 2], ["updated_at", "2014-12-18 17:30:16.246386"]]
---
  def create_specification
    @specification = Specification.new(params[:specification])
    @hotel = Hotel.find_by_id(params[:specification][:hotel_id])

    if @hotel.blank?
      render :file => "#{Rails.root}/public/404.html", :status => 404, :layout => false
    else
      if @specification.save

SELECT  "hotels".* FROM "hotels"  WHERE "hotels"."id" = 1  ORDER BY name ASC LIMIT 1
---
  def specifications
    @hotel = Hotel.find_by_id(params[:hotel_id])

SELECT  "specifications".* FROM "specifications"  WHERE "specifications"."id" = 9  ORDER BY specification_type_id ASC, name ASC LIMIT 1
---
  def edit_specification
    @specification = Specification.find_by_id(params[:specification_id])

SELECT  "specifications".* FROM "specifications"  WHERE "specifications"."id" IS NULL  ORDER BY specification_type_id ASC, name ASC LIMIT 1
UPDATE "specifications" SET "name" = $1, "updated_at" = $2 WHERE "specifications"."id" = 8  [["name", "Repas et boissonse"], ["updated_at", "2014-12-18 20:11:00.467617"]]
SELECT  "hotels".* FROM "hotels"  WHERE "hotels"."id" = $1  ORDER BY name ASC LIMIT 1  [["id", 1]]
---
  def update_specification
    @specification = Specification.find_by_id(params[:specification_id])

    if @specification.blank?
      render :file => "#{Rails.root}/public/404.html", :status => 404, :layout => false
    else
      @hotel = @specification.hotel
      if @specification.update(params[:specification])
        flash.now[:success] = "La spécification a été mise à jour."
      else
        flash.now[:error] = @specification.errors.full_messages.map{ |msg| "#{msg}<br />" }.join

SELECT "specifications".* FROM "specifications"  WHERE "specifications"."hotel_id" = $1  ORDER BY specification_type_id ASC, name ASC  [["hotel_id", 1]]
---
  def enable_specification
    @specification = Specification.find_by_id(params[:specification_id])

SELECT "specifications".* FROM "specifications"  WHERE "specifications"."hotel_id" = $1  ORDER BY specification_type_id ASC, name ASC  [["hotel_id", 1]]
---
  def disable_specification
    @specification = Specification.find_by_id(params[:specification_id])