app/controllers/miscs_controller.rb

  def create
    @misc = Misc.new(params[:misc])

    if @misc.save
---
INSERT INTO "miscs" ("created_at", "description", "icon_content_type", "icon_file_name", "icon_file_size", "icon_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @miscs = Misc.all
---
SELECT "miscs".* FROM "miscs"   ORDER BY description ASC

  def edit
    @misc = Misc.find_by_id(params[:id])
---
SELECT  "miscs".* FROM "miscs"  WHERE "miscs"."id" = 2  ORDER BY description ASC LIMIT 1

  def update
    @misc = Misc.find_by_id(params[:id])
    @misc_description = @misc.description

    if @misc.blank?
      render :file => "#{Rails.root}/public/404.html", :status => 404, :layout => false
    else
      if @misc.update(params[:misc])
---
SELECT  "miscs".* FROM "miscs"  WHERE "miscs"."id" = 2  ORDER BY description ASC LIMIT 1
SELECT  1 AS one FROM "miscs"  WHERE ("miscs"."description" = 'Petit-Déjeuner compris' AND "miscs"."id" != 2) LIMIT 1
UPDATE "miscs" SET "icon_file_name" = $1, "icon_file_size" = $2, "icon_updated_at" = $3, "updated_at" = $4 WHERE "miscs"."id" = 2  [["icon_file_name", "35-512.png"], ["icon_file_size", 26288], ["icon_updated_at", "2014-12-18 12:08:25.367141"], ["updated_at", "2014-12-18 12:08:26.138758"]]

  def enable
    @misc = Misc.find_by_id(params[:id])
---
SELECT  "miscs".* FROM "miscs"  WHERE "miscs"."id" = 2  ORDER BY description ASC LIMIT 1

  def disable
    @misc = Misc.find_by_id(params[:id])
---
SELECT  "miscs".* FROM "miscs"  WHERE "miscs"."id" = 2  ORDER BY description ASC LIMIT 1