app/controllers/specification_types_controller.rb

  def create
    @specification_type = SpecificationType.new(params[:specification_type])

    if @specification_type.save
---
INSERT INTO "specification_types" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-12-18 01:04:06.499568"], ["name", "L’essentiel"], ["updated_at", "2014-12-18 01:04:06.499568"]]

  def show
    @specification_types = SpecificationType.all
---
SELECT "specification_types".* FROM "specification_types"   ORDER BY name ASC

  def edit
    @specification_type = SpecificationType.find_by_id(params[:id])
---
SELECT  "specification_types".* FROM "specification_types"  WHERE "specification_types"."id" = 6  ORDER BY name ASC LIMIT 1

  def update
    @specification_type = SpecificationType.find_by_id(params[:id])
    @specification_type_name = @specification_type.name

    if @specification_type.blank?
      render :file => "#{Rails.root}/public/404.html", :status => 404, :layout => false
    else
      if @specification_type.update(params[:specification_type])
---
SELECT  "specification_types".* FROM "specification_types"  WHERE "specification_types"."id" = 6  ORDER BY name ASC LIMIT 1
SELECT  1 AS one FROM "specification_types"  WHERE ("specification_types"."name" = 'Dans la chambreu' AND "specification_types"."id" != 6) LIMIT 1
UPDATE "specification_types" SET "name" = $1, "updated_at" = $2 WHERE "specification_types"."id" = 6  [["name", "Dans la chambreu"], ["updated_at", "2014-12-18 01:05:50.322756"]]

  def enable
    @specification_type = SpecificationType.find_by_id(params[:id])
---
SELECT  "specification_types".* FROM "specification_types"  WHERE "specification_types"."id" = 5  ORDER BY name ASC LIMIT 1

  def disable
    @specification_type = SpecificationType.find_by_id(params[:id])
---
SELECT  "specification_types".* FROM "specification_types"  WHERE "specification_types"."id" = 5  ORDER BY name ASC LIMIT 1