app/views/cities/index.html.erb

SELECT  "countries".* FROM "countries"  WHERE "countries"."name" = 'Côte d''Ivoire'  ORDER BY name ASC LIMIT 1
---
            <div class="formRight">
              <%= f.collection_select :country_id, @countries, :id, :name, options ={prompt: "-Veuillez choisir un pays-", selected: (Country.find_by_name("Côte d'Ivoire").id rescue nil)}, html_options = {class: "form-control"} %>