app/views/cities/show.html.erb

              <td>
                <%= city.hotels.count %>
---
SELECT COUNT(*) FROM "hotels"  WHERE "hotels"."city_id" = $1  [["city_id", 1]]