app/views/hotels/specifications.html.erb

              <td>
                <%= specification.sub_specifications.count %>
---
SELECT "specifications".* FROM "specifications"  WHERE "specifications"."hotel_id" = $1  ORDER BY specification_type_id ASC, name ASC  [["hotel_id", 1]]